# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [27]:
import pandas as pd

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [28]:
employee = pd.read_csv('Employee.csv')
employee.head(9)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [29]:
employee.shape

(9, 7)

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [30]:
employee.groupby(['Department', 'Salary']).mean()

                   Years
Department Salary
HR         30        2.0
           35        4.0
           70        8.0
IT         30        2.0
           35        1.0
           60        7.0
           70        8.0
Sales      55        2.5

In [31]:
pivot_employee = employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = ['mean']).reset_index().head()

In [32]:
pivot_employee.head()

  Department   mean
             Salary
0         HR  45.00
1         IT  48.75
2      Sales  55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [33]:
department = employee.pivot_table(index= ['Department','Title'], values = ['Salary'], aggfunc = ['mean']).reset_index().head()

In [34]:
department.head()

  Department      Title   mean
                        Salary
0         HR         VP   70.0
1         HR    analyst   32.5
2         IT         VP   70.0
3         IT    analyst   32.5
4         IT  associate   60.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [35]:
years = employee.pivot_table(index= ['Department','Title','Years'], values = ['Salary'], aggfunc = ['mean']).reset_index()

In [36]:
years.head()

  Department    Title Years   mean
                            Salary
0         HR       VP     8     70
1         HR  analyst     2     30
2         HR  analyst     4     35
3         IT       VP     8     70
4         IT  analyst     1     35

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [37]:
employee = employee.pivot_table(index= ['Department','Title'], values = ['Salary','Name'], aggfunc = {'Salary':'mean','Name':'count'}).reset_index().head()

In [38]:
employee.head()

  Department      Title  Name  Salary
0         HR         VP     1    70.0
1         HR    analyst     2    32.5
2         IT         VP     1    70.0
3         IT    analyst     2    32.5
4         IT  associate     1    60.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [40]:
# your answer here
employee= employee.pivot_table(index= ['Department','Title'], values = ['Salary'], aggfunc = ['mean','median','max','std']).reset_index().head()

In [41]:
employee.head()

  Department      Title   mean median    max
                        Salary Salary Salary
0         HR         VP   70.0   70.0   70.0
1         HR    analyst   32.5   32.5   32.5
2         IT         VP   70.0   70.0   70.0
3         IT    analyst   32.5   32.5   32.5
4         IT  associate   60.0   60.0   60.0

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
#But I don't see any mising values..is this a trick question?

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [42]:
employee.pivot_table(index='Department', values = ['Name','Salary'], aggfunc = {'Name':'count', 'Salary':'sum'})

KeyError: 'Name'

In [ ]:
#why is name giving me a key error?

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [43]:
employee.pivot_table(index=['Title','Department'], values = ['Years','Salary'], aggfunc = {'Years':'sum','Salary':'mean'})

KeyError: 'Years'

In [ ]:
#I don't understand why i'm getting these errors.

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here